# Intermediate SQL with SQLite in Python

In this lesson, we will work with the **Sakila** database—a sample database originally created by MySQL and ported to SQLite. The Sakila database contains a rich schema (including tables such as `actor`, `film`, `film_actor`, etc.) that provides real-world data to explore advanced SQL techniques.

### What You'll Learn:
- How to connect to a SQLite database file (`sakila.db`) using Python's `sqlite3` module.
- How to explore the Sakila database schema by listing tables and previewing data.
- How to write SQL queries using JOINs, aggregate functions, GROUP BY, and HAVING.
- How to apply these techniques with partner practice exercises.

**Note:** Ensure the `sakila.db` file is in your working directory before running the notebook.

In [2]:
import sqlite3
import pandas as pd

# Set the path to the SQLite database
db_path = "sakila.db"

# Connect to SQLite database
conn = sqlite3.connect(db_path)
print("Connected to SQLite Sakila database!")

Connected to SQLite Sakila database!

### Exploring the Database Schema

Before diving into queries, it's useful to know which tables are available in the Sakila database. We'll list all tables by querying the SQLite master table.

In [1]:
# List all tables in the database
tables = pd.read_sql("""SELECT name 
                        FROM sqlite_master 
                        WHERE type='table';""", conn)

print("Tables in the database:")
print(tables)

NameError: name 'pd' is not defined

### Viewing Sample Data from the 'actor' Table

Let's preview a few rows from the `actor` table to see what kind of data it holds.

Select the following columns:
- actor_id
- first_name
- last_name

Connect two string columns with || ' ' || and create an alias with "AS"

In [ ]:
# Define SQL query to fetch the first 5 rows from the actor table.
query_actor = """SELECT actor_id, first_name ||' '|| last_name AS actor_name
                    FROM actor
                    LIMIT 5
                
              """

# Execute the query using pd.read_sql.
df_actor = pd.read_sql(query_actor, conn)

print("Sample rows from the 'actor' table:")
print(df_actor)

Sample rows from the 'actor' table:
   actor_id           actor_name
0         1     PENELOPE GUINESS
1         2        NICK WAHLBERG
2         3             ED CHASE
3         4       JENNIFER DAVIS
4         5  JOHNNY LOLLOBRIGIDA

### Viewing Sample Data from the 'film' Table

Let's preview a few rows from the `film` table to see what kind of data it holds.

Select the following columns:
- film_id
- title
- length
- rating

In [ ]:
# Define SQL query to fetch the first 5 rows from the actor table.
query_film = """SELECT film_id, title, length, rating
                FROM film
                LIMIT 5;

             """

# Execute the query using pd.read_sql.
df_film = pd.read_sql(query_film, conn)

print("Sample rows from the 'film' table:")
print(df_film)

Sample rows from the 'film' table:
   film_id             title  length rating
0        1  ACADEMY DINOSAUR      86     PG
1        2    ACE GOLDFINGER      48      G
2        3  ADAPTATION HOLES      50  NC-17
3        4  AFFAIR PREJUDICE     117      G
4        5       AFRICAN EGG     130      G

### Viewing Sample Data from the 'film_actor' Table

Let's preview a few rows from the `film_actor` table to see what kind of data it holds.

Select all columns.

In [ ]:
# Define SQL query to fetch the first 5 rows from the actor table.
query_film_actor = """ SELECT *
                    FROM film_actor
                    LIMIT 5

                   """

# Execute the query using pd.read_sql.
df_film_actor = pd.read_sql(query_film_actor, conn)

print("Sample rows from the 'film_actor' table:")
print(df_film_actor)

Sample rows from the 'film_actor' table:
   actor_id  film_id          last_update
0         1        1  2021-03-06 15:52:45
1         1       23  2021-03-06 15:52:45
2         1       25  2021-03-06 15:52:45
3         1      106  2021-03-06 15:52:45
4         1      140  2021-03-06 15:52:45

### JOIN Query: Actors and Their Films

Next, we'll join three tables—`actor`, `film_actor`, and `film`—to list film titles along with the full names of actors who appear in them.

- **Tables Involved:**
  - `actor`: Contains actor details.
  - `film_actor`: A bridge table linking actors to films.
  - `film`: Contains film details.

The join connects:
- `actor.actor_id` with `film_actor.actor_id`
- `film_actor.film_id` with `film.film_id`

Let's see the first 10 actor-film associations.

In [ ]:
# Define SQL query for actor-film associations.
join_query = """SELECT actor.first_name, actor.last_name, film.title
                FROM actor
                JOIN film_actor ON actor.actor_id = film_actor.actor_id
                JOIN film ON film.film_id = film_actor.film_id
                ORDER BY actor.actor_id DESC
                LIMIT 10
             """

# Execute the query using pd.read_sql.
df_join = pd.read_sql(join_query, conn)

print("Actor - Film Associations (first 10 rows):")
print(df_join)

Actor - Film Associations (first 10 rows):
  first_name last_name                title
0      THORA    TEMPLE          AFRICAN EGG
1      THORA    TEMPLE          BADMAN DAWN
2      THORA    TEMPLE      BLANKET BEVERLY
3      THORA    TEMPLE  CANDIDATE PERDITION
4      THORA    TEMPLE          CAROL TEXAS
5      THORA    TEMPLE  CHRISTMAS MOONSHINE
6      THORA    TEMPLE   GALAXY SWEETHEARTS
7      THORA    TEMPLE          HOCUS FRIDA
8      THORA    TEMPLE      INSIDER ARIZONA
9      THORA    TEMPLE   INTERVIEW LIAISONS

### Aggregation Query: Counting Actors per Film

Now, we'll count the number of actors featured in each film. This query uses:
- **JOIN:** To connect `film` and `film_actor`.
- **GROUP BY:** To group data by film title.
- **HAVING:** To filter films with more than 3 actors.

This helps identify films with larger casts.

In [ ]:
# Define SQL query for counting actors per film.
agg_query = """SELECT f.title, COUNT(film_actor.actor_id) AS actor_count
                FROM film AS f
                LEFT JOIN film_actor ON f.film_id = film_actor.film_id
                GROUP BY f.film_id
                ORDER BY actor_count DESC
                LIMIT 50
            """

# Execute the query using pd.read_sql.
df_agg = pd.read_sql(agg_query, conn)

print("Films with more than 3 actors (top 10):")
print(df_agg)

Films with more than 3 actors (top 10):
                     title  actor_count
0         LAMBS CINCINATTI           15
1        BOONDOCK BALLROOM           13
2              CHITTY LOCK           13
3               CRAZY HOME           13
4          DRACULA CRYSTAL           13
5          MUMMY CREATURES           13
6                RANDOM GO           13
7             ARABIA DOGMA           12
8      HELLFIGHTERS SIERRA           12
9         LESSON CLEOPATRA           12
10         LONELY ELEPHANT           12
11             SKY MIRACLE           12
12        TITANIC BOONDOCK           12
13            FIDDLER LOST           11
14        FUGITIVE MAGUIRE           11
15         HOLES BRANNIGAN           11
16          IMAGE PRINCESS           11
17        INSTINCT AIRPORT           11
18            MAKER GABLES           11
19              MASK PEACH           11
20             OZ LIAISONS           11
21         PINOCCHIO SIMON           11
22     RINGS HEARTBREAKERS           11
23          SPICE SORORITY           11
24      SPIRIT FLINTSTONES           11
25           SUBMARINE BED           11
26  TELEMARK HEARTBREAKERS           11
27        ACADEMY DINOSAUR           10
28            BERETS AGENT           10
29     CHINATOWN GLADIATOR           10
30           COAST RAINBOW           10
31             CROW GREASE           10
32             DARES PLUTO           10
33          HEAVEN FREEDOM           10
34       HOOSIERS BIRDCAGE           10
35             INDIAN LOVE           10
36           JACKET FRISCO           10
37            LUCKY FLYING           10
38           OLEANDER CLUE           10
39         POLISH BROOKLYN           10
40      PREJUDICE OLEANDER           10
41          ROOTS REMEMBER           10
42            SAINTS BRIDE           10
43        SHAWSHANK BUBBLE           10
44             SPLASH GUMP           10
45         SPLENDOR PATTON           10
46          WEDDING APOLLO           10
47        WEEKEND PERSONAL           10
48           ALABAMA DEVIL            9
49             ANGELS LIFE            9

# Group Exercises
- Find a neighbor, yes, move around and make a new friend!
- Work through the following practice exercises together.

# Partner Practice Exercise

Now that we've seen several examples of JOINs and aggregation queries, it's time for you to practice with a partner. Complete the following tasks using the Sakila database:

1. **Task 1: Write a JOIN Query**
   - Write a query to retrieve a list of films along with the full names of the actors (first and last name) who acted in them.
   - *Hint:* Join the `film`, `film_actor`, and `actor` tables. Use string concatenation (e.g., `first_name || ' ' || last_name`) for full names.

2. **Task 2: Write an Aggregation Query**
   - Write a query to find the average film length for each film category.
   - *Hint:* Join the `film`, `film_category`, and `category` tables, then use the `AVG()` function with `GROUP BY`.

3. **Task 3: Challenge Task (Optional)**
   - Combine your results: Write a query to list film titles, the count of actors in each film, and the film category. Filter to show only films with more than 5 actors.
   - *Hint:* You might need to use multiple joins and group by both film title and category.

Discuss your approaches with your partner, compare your results, and be ready to review a few solutions as a class.

In [ ]:
# Task 1: Retrieve a list of films along with the full names of the actors.
task1_query = """

              """

# Execute the query using pd.read_sql.
df_task1 = pd.read_sql(task1_query, conn)

print("Task 1: Films with Actor Full Names (first 20 rows):")
print(df_task1)

TypeError: 'NoneType' object is not iterable

In [ ]:
# Task 2: Find the average film length for each film category.
task2_query = """SELECT c.name AS category, AVG(f.length) AS avg_length
                FROM film as f
                JOIN film_category AS FC ON f.film_id = FC.film_id
                JOIN category AS c ON fc.category_id = c.category_id
                GROUP BY c.name
                ORDER BY avg_length DESC

              """

# Execute the query using pd.read_sql.
df_task2 = pd.read_sql(task2_query, conn)

print("Task 2: Average Film Length per Category:")
print(df_task2)

Task 2: Average Film Length per Category:
       category  avg_length
0        Sports  128.202703
1         Games  127.836066
2       Foreign  121.698630
3         Drama  120.838710
4        Comedy  115.827586
5        Family  114.782609
6         Music  113.647059
7        Travel  113.315789
8        Horror  112.482143
9      Classics  111.666667
10       Action  111.609375
11          New  111.126984
12    Animation  111.015152
13     Children  109.800000
14  Documentary  108.750000
15       Sci-Fi  108.196721

In [ ]:
# Task 3: List film titles, count of actors, and film category for films with more than 5 actors.
task3_query = """

            """

# Execute the query using pd.read_sql.
df_task3 = pd.read_sql(task3_query, conn)

print("Task 3: Films with more than 5 Actors (showing film title, actor count, category):")
print(df_task3)

## Close the connection to the database.
Always close the connection when you're done to free up resources.

In [ ]:
# Close the connection
#conn.close()